The following is the output from the plan phase:
```

  # octopusdeploy_kubernetes_cluster_deployment_target.default will be created
  + resource "octopusdeploy_kubernetes_cluster_deployment_target" "default" {
      + cluster_certificate               = "Certificates-3"
      + cluster_url                       = "https://***.k8s.ondigitalocean.com"
      + environments                      = [
          + "Environments-4",
        ]
      + has_latest_calamari               = (known after apply)
      + health_status                     = (known after apply)
      + id                                = (known after apply)
      + is_disabled                       = (known after apply)
      + is_in_process                     = (known after apply)
      + machine_policy_id                 = (known after apply)
      + name                              = "test-kubernetes"
      + operating_system                  = (known after apply)
      + roles                             = [
          + "services",
        ]
      + shell_name                        = (known after apply)
      + shell_version                     = (known after apply)
      + space_id                          = (known after apply)
      + status                            = (known after apply)
      + status_summary                    = (known after apply)
      + tenanted_deployment_participation = "Untenanted"
      + thumbprint                        = (known after apply)
      + uri                               = (known after apply)

      + aws_account_authentication {
          + account_id                   = (known after apply)
          + assume_role                  = (known after apply)
          + assume_role_external_id      = (known after apply)
          + assume_role_session_duration = (known after apply)
          + assumed_role_arn             = (known after apply)
          + assumed_role_session         = (known after apply)
          + cluster_name                 = (known after apply)
          + use_instance_role            = (known after apply)
        }

      + azure_service_principal_authentication {
          + account_id             = (known after apply)
          + cluster_name           = (known after apply)
          + cluster_resource_group = (known after apply)
        }

      + certificate_authentication {
          + client_certificate = (known after apply)
        }

      + container {
          + feed_id = "Feeds-1001"
          + image   = "octopusdeploy/worker-tools:2.0.1-ubuntu.18.04"
        }

      + token_authentication {
          + account_id = "Accounts-4"
        }

      + username_password_authentication {
          + account_id = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

  # octopusdeploy_kubernetes_cluster_deployment_target.default will be created
  + resource "octopusdeploy_kubernetes_cluster_deployment_target" "default" {
      + cluster_certificate               = "Certificates-3"
      + cluster_url                       = "https://***.k8s.ondigitalocean.com"
      + environments                      = [
          + "Environments-4",
        ]
      + has_latest_calamari               = (known after apply)
      + health_status                     = (known after apply)
      + id                                = (known after apply)
      + is_disabled                       = (known after apply)
      + is_in_process                     = (known after apply)
      + machine_policy_id                 = (known after apply)
      + name                              = "test-kubernetes"
      + operating_system                  = (known after apply)
      + roles                             = [
          + "services",
        ]
      + shell_name                        = (known after apply)
      + shell_version                     = (known after apply)
      + space_id                          = (known after apply)
      + status                            = (known after apply)
      + status_summary                    = (known after apply)
      + tenanted_deployment_participation = "Untenanted"
      + thumbprint                        = (known after apply)
      + uri                               = (known after apply)

      + aws_account_authentication {
          + account_id                   = (known after apply)
          + assume_role                  = (known after apply)
          + assume_role_external_id      = (known after apply)
          + assume_role_session_duration = (known after apply)
          + assumed_role_arn             = (known after apply)
          + assumed_role_session         = (known after apply)
          + cluster_name                 = (known after apply)
          + use_instance_role            = (known after apply)
        }

      + azure_service_principal_authentication {
          + account_id             = (known after apply)
          + cluster_name           = (known after apply)
          + cluster_resource_group = (known after apply)
        }

      + certificate_authentication {
          + client_certificate = (known after apply)
        }

      + container {
          + feed_id = "Feeds-1001"
          + image   = "octopusdeploy/worker-tools:2.0.1-ubuntu.18.04"
        }

      + token_authentication {
          + account_id = "Accounts-4"
        }

      + username_password_authentication {
          + account_id = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```